tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

# brew
brew "sqlite"
brew "ansible"
brew "bash"
brew "git"
brew "go"
brew "openjdk" # "java"
brew "gradle"
brew "jenv"
brew "kotlin"
brew "mackup"
brew "mas" # requires Xcode, and not working perfectly...
brew "mysql"
brew "nkf"
brew "nodebrew"
brew "postgresql"
brew "pyenv"
brew "rbenv"
brew "redis"
brew "sbt"
brew "tree"
brew "zsh"

# Universal
cask "alfred"
cask "bartender"
cask "cheatsheet"
cask "flux"
cask "font-ricty-diminished"
cask "google-chrome"
cask "imazing"
cask "iterm2"
# cask "paragon-ntfs" # after, manual FSInstaller.app & (SIP) enable kext...
cask "screens"
cask "sequel-ace"
cask "symboliclinker"
cask "teamviewer"
cask "transmit"

# Apple Silicon
cask "keepassxc" # iOS
cask "visual-studio-code" # iOS
cask "vlc" # iOS
cask "zoom"
# "docker-preview" needs manual install

# Intel
cask "android-studio"
cask "authy"
cask "beyond-compare"
cask "caffeine"
cask "cakebrew"
cask "chrome-remote-desktop-host"
cask "coda"
cask "cyberduck"
cask "dbeaver-community"
cask "discord"
# cask "docker"
cask "dropbox"
cask "forklift"
cask "github"
cask "google-japanese-ime"
cask "hyperswitch"
cask "keepassx"
cask "libreoffice"
cask "line-bot-designer"
cask "microsoft-teams"
cask "mysqlworkbench"
cask "psequel"
# cask "sequel-pro" # >> "sequel-ace"
cask "servpane"
cask "skype"
cask "sourcetree"
cask "sqlworkbenchj"
cask "sublime-text"
cask "thunderbird"
cask "vagrant"
cask "virtualbox"
cask "vmware-fusion10"
cask "wireshark"
cask "xquartz" # Other

# "mas" not working perfectly on ARM...
mas "Base", id: 402383384
mas "Cleaner-App", id: 1013897218
mas "DaisyDisk", id: 411643860
mas "Disk Diag", id: 672206759
mas "Disk Speed Test", id: 425264550
mas "Display Menu", id: 549083868
mas "GrandPerspective", id: 1111570163
mas "iNet Network Scanner", id: 403304796
mas "iStat Menus", id: 1319778037
mas "Kindle", id: 405399194
mas "LanScan", id: 472226235
mas "LINE", id: 539883307
mas "Magnet", id: 441258766
mas "Microsoft Excel", id: 462058435
mas "Network Kit", id: 979299240
mas "Paw", id: 584653203
mas "Pixelmator", id: 407963104
mas "PopClip", id: 445189367
mas "QR Journal", id: 483820530
mas "Quip", id: 1003160018
mas "SiteSucker", id: 442168834
mas "Skitch", id: 425955336
mas "Slack", id: 803453959
mas "Soulver", id: 413965349
mas "Spark", id: 1176895641
mas "Speedtest", id: 1153157709
mas "The Unarchiver", id: 425424353
mas "WinArchiver Lit‪e", id: 414855915
# mas "Wunderlist", id: 410628904 # >> Microsoft To Do
mas "Yoink", id: 457622435
# Apple
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
